
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	УправлениеВидимостьюЭлФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	УправлениеВидимостьюЭлФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервере
Процедура УправлениеВидимостьюЭлФормы()
	ЭтоПосещенияУпражнения = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеУпражнения);
	Элементы.ВидУпражнения.Видимость = ЭтоПосещенияУпражнения;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещенияУпражнения;
КонецПроцедуры	

#КонецОбласти
