
#Область ПрограммныйИнтерфейс

// Код процедур и функций
// 
// Параметры:
//  СтрТелефон - строка телефон
// 
// Возвращаемое значение нормализованный еомер телефона:
//  
Функция НормализованныйНомерТелефона(СтрТелефон, ВызыватьИсключение = Ложь) Экспорт
	Цифры = "0123456789";
	ЦифрыТелефона = "";
	
	Для Сч = 1 По СтрДлина(СтрТелефон) Цикл
		Символ = Сред(СтрТелефон,Сч,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Продолжить;
		КонецЕсли;	
		ЦифрыТелефона = ЦифрыТелефона + Символ;
	КонецЦикла;
	
	Если СтрНачинаетсяС(ЦифрыТелефона, "8") Тогда
		ЦифрыТелефона = "7" + Сред(ЦифрыТелефона,2);
	КонецЕсли;
	
	Ошибки = Новый Массив;
	Если НЕ СтрНачинаетсяС(ЦифрыТелефона, "7") Тогда
		Ошибки.Добавить("Первая цифра номера телефона начинается НЕ с 7 или 8");
	КонецЕсли;
	Если НЕ СтрДлина(ЦифрыТелефона) = 11 Тогда
		Ошибки.Добавить("Номер телефона должен содержать 11 цифр");
	КонецЕсли;
	Если Ошибки.Количество() > 0 Тогда
		Если ВызыватьИсключение  Тогда
			ВызватьИсключение СтрСоединить(Ошибки,"; ");
		Иначе 
			Результат = "";
		КонецЕсли;
	КонецЕсли;
	Результат = ЦифрыТелефона;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
