
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций


Процедура ПередЗаписью(Отказ)
	//TODO: Вставить содержимое обработчика
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Телефон = НомерТелефонаКлиентСервер.НормализованныйНомерТелефона(Телефон, Истина);
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
