
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций


&НаКлиенте
Процедура ПереходНаВерсию1002(Команда)
	ПереходНаВерсию1002НаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервереБезКонтекста
Процедура ПереходНаВерсию1002НаСервере()
	//TODO: Вставить содержимое обработчика
	Документы.ПродажаБилета.ПеренестиНоменклатуруВТабличнуюЧасть();
	
КонецПроцедуры

#КонецОбласти
